# IdeaStatiCa.ConnectionApi.Model.ConTemplateCreateResult

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**TemplateId** | **Guid** |  | [optional]
**Name** | **string** |  | [optional]
**DesignCode** | **string** |  | [optional]
**VarVersion** | **int** |  | [optional]
**ManufacturingType** | **string** |  | [optional]
**TypologyCode** | **string** |  | [optional]
**TypologyCodeV2** | **string** |  | [optional]
**OperationCount** | **int** |  | [optional]
**ParameterCount** | **int** |  | [optional]
**ParamModelLinkCount** | **int** |  | [optional]
**Template** | **string** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)